# HasEnded Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SubTransaction..::..HasEnded Method
SubTransaction Class See Also
---
Determines whether the sub-transaction has ended already.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasEnded()
```

Visual Basic
---
```text
Public Function HasEnded As Boolean
```

Visual C++
---
```text
public:
bool HasEnded()
```

# ### Return Value
True if the sub-transaction has already been committed or rolled back, False otherwise.
# Remarks
A sub-transaction is ended by completing either the Commit or RollBack method. Another way of testing whether a sub-transaction has ended is by testing its current status returned from (see GetStatus()()()()). It must be either 'TransactionStatus.Committed' or 'TransactionStatus.RolledBack'
# See Also
SubTransaction Class
Autodesk.Revit.DB Namespace